In [2]:
import pandas as pd
import numpy as np

In [3]:
pd.__version__

'1.5.3'

In [4]:
None, np.nan

(None, nan)

In [5]:
s = pd.Series([1, 3, 4, np.nan, 6, 8])
s

0    1.0
1    3.0
2    4.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [6]:
type(s)

pandas.core.series.Series

In [7]:
dates = pd.date_range('20130101', periods =6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [8]:
type(dates)

pandas.core.indexes.datetimes.DatetimeIndex

In [9]:
df = pd.DataFrame({'A' : [1, 2, 3],
                  'B' : [1, 2, 3],
                  'C' : [1, 2, 3]})
df

   A  B  C
0  1  1  1
1  2  2  2
2  3  3  3

In [10]:
type(df)

pandas.core.frame.DataFrame

In [11]:
df = pd.DataFrame(np.random.randn(6,4),
                 index=dates,
                 columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  1.059853  0.652256  2.340937 -0.702279
2013-01-02 -0.925878  0.278047  1.084900 -0.187348
2013-01-03  1.327163  0.538675 -1.209917  1.088305
2013-01-04  0.563023 -2.686259  0.875746 -1.049762
2013-01-05  0.464680 -0.699117 -1.338433  0.224756
2013-01-06 -0.361165 -1.201100  0.220253 -0.195697

In [12]:
df2 = pd.DataFrame({
                    'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3] * 4, dtype='int32'),
                    'E': pd.Categorical(["test", "train", "test", "train"]),
                    'F': 'foo',
                    'G' : [False, True,True,False]
                   })
df2

     A          B    C  D      E    F      G
0  1.0 2013-01-02  1.0  3   test  foo  False
1  1.0 2013-01-02  1.0  3  train  foo   True
2  1.0 2013-01-02  1.0  3   test  foo   True
3  1.0 2013-01-02  1.0  3  train  foo  False

In [13]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 3
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      float64
 1   B       4 non-null      datetime64[ns]
 2   C       4 non-null      float32
 3   D       4 non-null      int32
 4   E       4 non-null      category
 5   F       4 non-null      object
 6   G       4 non-null      bool
dtypes: bool(1), category(1), datetime64[ns](1), float32(1), float64(1), int32(1), object(1)
memory usage: 292.0+ bytes

In [14]:
dane_sprzedaz_df = pd.read_csv('data/dane_sprzedaz.csv', sep=',', encoding='utf-8')
dane_sprzedaz_df

     DZIEN_DATA  SKL_ID  TOW_ID  SPRZ_NETTO  ZYSK_PROCENT ZYSK_WART
0    01.05.2022       1       1       416.0             9     37,44
1    02.05.2022       1       1       454.0             2      9,08
2    03.05.2022       1       1       392.0            13     50,96
3    04.05.2022       1       1       498.0             9     44,82
4    05.05.2022       1       1       341.0            15     51,15
..          ...     ...     ...         ...           ...       ...
130  11.05.2022       3       3       374.0             7     26,18
131  12.05.2022       3       3       390.0             4      15,6
132  13.05.2022       3       3       485.0            10      48,5
133  14.05.2022       3       3       479.0             3     14,37
134  15.05.2022       3       3       366.0            13     47,58

[135 rows x 6 columns]

In [15]:
dane_sprzedaz_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 135 entries, 0 to 134
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   DZIEN_DATA    135 non-null    object
 1   SKL_ID        135 non-null    int64
 2   TOW_ID        135 non-null    int64
 3   SPRZ_NETTO    133 non-null    float64
 4   ZYSK_PROCENT  135 non-null    int64
 5   ZYSK_WART     135 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 6.5+ KB

In [16]:
dane_sprzedaz_df.describe()

           SKL_ID      TOW_ID  SPRZ_NETTO  ZYSK_PROCENT
count  135.000000  135.000000  133.000000    135.000000
mean     2.000000    2.000000  397.473684      7.659259
std      0.819538    0.819538   54.623724      4.044829
min      1.000000    1.000000  300.000000      1.000000
25%      1.000000    1.000000  356.000000      4.000000
50%      2.000000    2.000000  390.000000      7.000000
75%      3.000000    3.000000  443.000000     11.000000
max      3.000000    3.000000  498.000000     15.000000

In [17]:
df = pd.DataFrame(np.random.randn(6,4),
                 index=dates,
                 columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.500253  1.679039  0.578435  0.395240
2013-01-02  2.387163 -0.127038 -0.501750  0.673097
2013-01-03 -1.065824  0.376120 -0.748305 -1.265887
2013-01-04 -0.734390  1.550780  1.212571 -0.918419
2013-01-05 -0.050761  1.239048  1.559377 -0.341014
2013-01-06 -0.209842  0.586607 -1.578165  0.559705

In [18]:
df.head(4)

                   A         B         C         D
2013-01-01  0.500253  1.679039  0.578435  0.395240
2013-01-02  2.387163 -0.127038 -0.501750  0.673097
2013-01-03 -1.065824  0.376120 -0.748305 -1.265887
2013-01-04 -0.734390  1.550780  1.212571 -0.918419

In [19]:
df.tail()

                   A         B         C         D
2013-01-02  2.387163 -0.127038 -0.501750  0.673097
2013-01-03 -1.065824  0.376120 -0.748305 -1.265887
2013-01-04 -0.734390  1.550780  1.212571 -0.918419
2013-01-05 -0.050761  1.239048  1.559377 -0.341014
2013-01-06 -0.209842  0.586607 -1.578165  0.559705

In [20]:
df.values

array([[ 0.50025311,  1.67903853,  0.57843494,  0.39524012],
       [ 2.38716281, -0.12703841, -0.50175007,  0.67309699],
       [-1.06582402,  0.37611963, -0.74830511, -1.26588721],
       [-0.73438995,  1.55077973,  1.21257141, -0.91841862],
       [-0.05076057,  1.23904841,  1.55937698, -0.34101446],
       [-0.20984151,  0.58660718, -1.57816514,  0.5597051 ]])

In [21]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [22]:
import numpy as np
import pandas as pd

my_array = np.array([[11,22,33],[44,55,66]])

df_numpy = pd.DataFrame(my_array, columns = ['Column_A','Column_B','Column_C'])

print(df_numpy)
print(type(df_numpy))

   Column_A  Column_B  Column_C
0        11        22        33
1        44        55        66
<class 'pandas.core.frame.DataFrame'>

In [23]:
data = {
        'col_1': [3, 2, 1, 0], 
        'col_2': ['a', 'b', 'c', 'd']
        }
pd.DataFrame.from_dict(data)

   col_1 col_2
0      3     a
1      2     b
2      1     c
3      0     d

In [24]:
df

                   A         B         C         D
2013-01-01  0.500253  1.679039  0.578435  0.395240
2013-01-02  2.387163 -0.127038 -0.501750  0.673097
2013-01-03 -1.065824  0.376120 -0.748305 -1.265887
2013-01-04 -0.734390  1.550780  1.212571 -0.918419
2013-01-05 -0.050761  1.239048  1.559377 -0.341014
2013-01-06 -0.209842  0.586607 -1.578165  0.559705

In [25]:
df.shape

(6, 4)

In [26]:
df.size

24

In [27]:
len(df)

6

In [28]:
df.sample(2)

                   A         B         C         D
2013-01-03 -1.065824  0.376120 -0.748305 -1.265887
2013-01-02  2.387163 -0.127038 -0.501750  0.673097

In [29]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

In [30]:
type(df)

pandas.core.frame.DataFrame

In [31]:
type(df.A) #chcecking out the type of specific column!

pandas.core.series.Series

In [32]:
df.A #Chcecking out

2013-01-01    0.500253
2013-01-02    2.387163
2013-01-03   -1.065824
2013-01-04   -0.734390
2013-01-05   -0.050761
2013-01-06   -0.209842
Freq: D, Name: A, dtype: float64

In [33]:
df.T #Transposition - changing columns with rows

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.500253    2.387163   -1.065824   -0.734390   -0.050761   -0.209842
B    1.679039   -0.127038    0.376120    1.550780    1.239048    0.586607
C    0.578435   -0.501750   -0.748305    1.212571    1.559377   -1.578165
D    0.395240    0.673097   -1.265887   -0.918419   -0.341014    0.559705

In [34]:
df_sample = df.sample(2)

In [35]:
df.sort_values(by="B", ascending = True)

                   A         B         C         D
2013-01-02  2.387163 -0.127038 -0.501750  0.673097
2013-01-03 -1.065824  0.376120 -0.748305 -1.265887
2013-01-06 -0.209842  0.586607 -1.578165  0.559705
2013-01-05 -0.050761  1.239048  1.559377 -0.341014
2013-01-04 -0.734390  1.550780  1.212571 -0.918419
2013-01-01  0.500253  1.679039  0.578435  0.395240

In [36]:
df #data frame bez interwencji

                   A         B         C         D
2013-01-01  0.500253  1.679039  0.578435  0.395240
2013-01-02  2.387163 -0.127038 -0.501750  0.673097
2013-01-03 -1.065824  0.376120 -0.748305 -1.265887
2013-01-04 -0.734390  1.550780  1.212571 -0.918419
2013-01-05 -0.050761  1.239048  1.559377 -0.341014
2013-01-06 -0.209842  0.586607 -1.578165  0.559705

In [37]:
df.reset_index(drop=True) #resetowanie indexu w Data Framie

          A         B         C         D
0  0.500253  1.679039  0.578435  0.395240
1  2.387163 -0.127038 -0.501750  0.673097
2 -1.065824  0.376120 -0.748305 -1.265887
3 -0.734390  1.550780  1.212571 -0.918419
4 -0.050761  1.239048  1.559377 -0.341014
5 -0.209842  0.586607 -1.578165  0.559705

In [38]:
df.reset_index(drop=False) #resetowanie indexu w Data Framie

       index         A         B         C         D
0 2013-01-01  0.500253  1.679039  0.578435  0.395240
1 2013-01-02  2.387163 -0.127038 -0.501750  0.673097
2 2013-01-03 -1.065824  0.376120 -0.748305 -1.265887
3 2013-01-04 -0.734390  1.550780  1.212571 -0.918419
4 2013-01-05 -0.050761  1.239048  1.559377 -0.341014
5 2013-01-06 -0.209842  0.586607 -1.578165  0.559705

In [39]:
df.sum()

A    0.826600
B    5.304555
C    0.522163
D   -0.897278
dtype: float64

In [40]:
df.min()

A   -1.065824
B   -0.127038
C   -1.578165
D   -1.265887
dtype: float64

In [41]:
df[['A']] #you can also write it as df.A

                   A
2013-01-01  0.500253
2013-01-02  2.387163
2013-01-03 -1.065824
2013-01-04 -0.734390
2013-01-05 -0.050761
2013-01-06 -0.209842

In [42]:
df

                   A         B         C         D
2013-01-01  0.500253  1.679039  0.578435  0.395240
2013-01-02  2.387163 -0.127038 -0.501750  0.673097
2013-01-03 -1.065824  0.376120 -0.748305 -1.265887
2013-01-04 -0.734390  1.550780  1.212571 -0.918419
2013-01-05 -0.050761  1.239048  1.559377 -0.341014
2013-01-06 -0.209842  0.586607 -1.578165  0.559705

In [43]:
df['A'][0] #To chose specific column and row from DataFrame

0.5002531128041372

In [44]:
df[0:3]

                   A         B         C         D
2013-01-01  0.500253  1.679039  0.578435  0.395240
2013-01-02  2.387163 -0.127038 -0.501750  0.673097
2013-01-03 -1.065824  0.376120 -0.748305 -1.265887

In [45]:
df['2013-01-01':'2013-01-03'] #To chose data from specific time out of timestamp row

                   A         B         C         D
2013-01-01  0.500253  1.679039  0.578435  0.395240
2013-01-02  2.387163 -0.127038 -0.501750  0.673097
2013-01-03 -1.065824  0.376120 -0.748305 -1.265887

In [46]:
b = pd.Series(np.round(np.random.uniform(0,1,10),2))
i = np.r_[0:10]
np.random.shuffle(i)
b.index = i
b

2    0.79
9    0.96
7    0.98
6    0.81
4    0.57
0    0.15
8    0.04
5    0.46
1    0.84
3    1.00
dtype: float64

In [47]:
b.iloc[2] # search by idx

0.98

In [48]:
b.loc[2] # search by name of idx

0.79

In [49]:
df.loc[2:4] # WRONG! This code has no name and will return ERROR, those columns name does not exist

TypeError: cannot do slice indexing on DatetimeIndex with these indexers [2] of type int

In [ ]:
df.loc[dates[0] : dates[1]] # Index related to date Index < > will be shown.

In [ ]:
df.iloc[0:2] # Searchin by index will work

In [ ]:
df[-3:5] # REMEMBER - [x, y]  -x goes down y goes up, the result is commont part of those

In [ ]:
df['A'][0]

In [ ]:
df.loc[dates[0:2], ['A', 'B']]

In [ ]:
df[ (df.A > 0.5) | (df.B > 0.5) ]

In [ ]:
df2 = df.copy()

In [ ]:
df2.columns = ['E', 'F', 'G', 'H'] # Change the name of Columns

In [ ]:
df2.rename(columns={"E": "A"}) # Change the name of Columns, but in other way

In [ ]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'pawe']
df2

In [ ]:
df2[ (df2.E == 'one') | (df2.E == 'two')]

In [ ]:
df2[ df2.E.isin(['one', 'two'])]

In [ ]:
df2[ df2.E.str.contains('o*e', regex=True, na=False)]

ZagroÅ¼enie regular expressions
    - Opcja "regex" = True,  wÅ‚Ä…cza moÅ¼liwoÅ›Ä‡ korzystania z funkcjonalnoÅ›ic RegexÃ³w.

In [ ]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))

In [ ]:
df2['F'] = s1
df2

In [ ]:
df2['F'] = 5 
df2

In [ ]:
df = pd.DataFrame(np.random.randn(6, 4), 
                  index=dates, 
                  columns=list('ABCD'))
df['D'] = -5
df['E'] = [np.nan, -1,-2,-3, -4, -5]
df['F'] = [1,2, np.nan, np.nan,np.nan, np.nan]

In [ ]:
df

In [ ]:
pd.isna(df) #Check witch columns are N/A

In [ ]:
df.isna().any() # Show witch one actually is N/A

In [ ]:
df[ df.isna().any(axis=1) ] # Show only those who have N/A value

In [ ]:
df.dropna(how='all') # dropping, where all values for column are N/A

In [ ]:
df.dropna(how='any') # dropping, where any of the values is N/A

In [ ]:
df.fillna(5) # fills na Values with given value

In [ ]:
df.fillna(method='ffill') # fill with the value above

In [ ]:
df.fillna(method='bfill') # fill with the value bellow

In [ ]:
df.fillna(df.mean())

In [ ]:
df = pd.DataFrame({'DZIEN_ID' : [1,2,3,4,5,6,7],
                   'SPRZEDAZ' : [100,150,300,np.nan,0,200,400],
                   'CENA' : [2.3, 2.2, 1.99, 2.4, np.nan, 2.1, 2.1],
                   'DZIEN_WOLNY' : [0,0,0,0,1,0,0],
                   'MECZ' : [0,0,0,1,0,0,0],
                  })
df

In [ ]:
df = pd.DataFrame(np.random.randn(6, 4), #Kod od Mentora 
                  index=dates, 
                  columns=list('ABCD'))
df['D'] = -5
df['E'] = [np.nan, -1,-2,-3, -4, -5]
df['F'] = [1,2, np.nan, np.nan,np.nan, np.nan]
df

In [ ]:
values = [40, 38, 32.5, 27, 33, 34]
 
df['new_col'] = values

s1 = pd.Series([40.5, 38.5, 33, 28, 26, 25], 
               index=[0, 1, 2, 3, 4, 5])
s2 = pd.Series([48.5, 42, 41, 37, 40, 39], 
               index=[0, 1, 2, 3, 4, 5])
 
df = df.assign(science_score=s1.values, 
                 english_score=s2.values)
df

In [ ]:
df.values # wszystkie wartoÅ›ci danego data frame

In [ ]:
df.A.values[0]

In [ ]:
df['avg_score'] = df.apply(lambda row: 
                          ((row.new_col + row.science_score + row.english_score) / 3),
                           axis = 1)
df

In [ ]:
df['avg_score'] = df.apply(lambda row: 
                          ((row.new_col + row.science_score) / 2),
                           axis = 1)
df

In [ ]:
df.drop(['A', 'B'], axis = 1) # axis works for columns / index = 0 , column = 1

In [54]:
df.drop(['20130101':'20130104'], axis=0) # axis works for columns / index = 0 , column = 1

SyntaxError: invalid syntax (1814826092.py, line 1)

In [55]:
# How to filter out dates between
df.drop(df.loc['20130101':'20130104'].index , axis=0) # axis works for columns / index = 0 , column = 1

                   A         B         C         D
2013-01-05 -0.050761  1.239048  1.559377 -0.341014
2013-01-06 -0.209842  0.586607 -1.578165  0.559705

In [58]:
df_groupby = pd.DataFrame(np.random.randn(10, 4))
df_groupby

          0         1         2         3
0 -1.633014  0.335130 -1.243980  0.173229
1  0.737404 -0.584954  0.558072  0.570585
2 -0.446557 -0.463193  0.382103 -0.438017
3  0.665596  0.230133  0.219178 -0.044484
4  0.755550 -1.696892  0.531668 -0.340329
5  0.622621 -0.579029 -1.451253  1.669377
6  0.815649  0.242019 -0.954982 -1.345013
7  2.172525  1.413395  0.844648  0.953178
8  0.686539 -0.174555  1.089671  0.681534
9  1.033333 -1.114852 -0.165564 -1.192553

In [60]:
df_groupby[:3]

          0         1         2         3
0 -1.633014  0.335130 -1.243980  0.173229
1  0.737404 -0.584954  0.558072  0.570585
2 -0.446557 -0.463193  0.382103 -0.438017

In [61]:
df_groupby[3:6]

          0         1         2         3
3  0.665596  0.230133  0.219178 -0.044484
4  0.755550 -1.696892  0.531668 -0.340329
5  0.622621 -0.579029 -1.451253  1.669377

In [62]:
pieces = [df_groupby[:3], df_groupby[3:7], df_groupby[7:]]  # podziaÅ‚ wg wierszy

In [67]:
type(pieces)

list

In [71]:
pd.concat(pieces)

          0         1         2         3
0 -1.633014  0.335130 -1.243980  0.173229
1  0.737404 -0.584954  0.558072  0.570585
2 -0.446557 -0.463193  0.382103 -0.438017
3  0.665596  0.230133  0.219178 -0.044484
4  0.755550 -1.696892  0.531668 -0.340329
5  0.622621 -0.579029 -1.451253  1.669377
6  0.815649  0.242019 -0.954982 -1.345013
7  2.172525  1.413395  0.844648  0.953178
8  0.686539 -0.174555  1.089671  0.681534
9  1.033333 -1.114852 -0.165564 -1.192553

In [82]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
left

   key  lval
0  foo     1
1  foo     2

In [83]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})
right

   key  rval
0  foo     4
1  foo     5

In [80]:
merged = pd.merge(left, right, on = 'key')
merged

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [84]:
df1 = pd.DataFrame({'a': ['foo', 'bar'], 'b': [1, 2]})
df2 = pd.DataFrame({'c': ['foo', 'baz'], 'b': [2, 4]})

In [85]:
df1

     a  b
0  foo  1
1  bar  2

In [86]:
df2

     c  b
0  foo  2
1  baz  4

In [88]:
df1.merge(df2, how='left', on='b')

     a  b    c
0  foo  1  NaN
1  bar  2  foo

In [89]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                         'foo', 'bar', 'foo', 'foo'],
                   'B': ['one', 'one', 'two', 'three',
                         'two', 'two', 'one', 'three'],
                   'C': np.random.randn(8),
                   'D': np.random.randn(8)})

In [90]:
df

     A      B         C         D
0  foo    one -1.923532 -2.153783
1  bar    one  1.419167 -0.439225
2  foo    two -0.217299 -1.732113
3  bar  three -0.319439  0.897701
4  foo    two -0.962593  2.575995
5  bar    two  1.516766 -1.877663
6  foo    one  0.678178 -0.914098
7  foo  three -0.058539  0.708845

In [94]:
df.groupby('A').sum()

/var/folders/ms/wkr5qnw531n49nj670qhvllh0000gn/T/ipykernel_15176/1885751491.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('A').sum()

            C         D
A
bar  2.616494 -1.419187
foo -2.483784 -1.515153

In [97]:
df2 = df.groupby(['A', 'B']).sum()
df2

                  C         D
A   B
bar one    1.419167 -0.439225
    three -0.319439  0.897701
    two    1.516766 -1.877663
foo one   -1.245354 -3.067881
    three -0.058539  0.708845
    two   -1.179892  0.843882

In [104]:
df2.loc['bar', 'one']

C    1.419167
D   -0.439225
Name: (bar, one), dtype: float64

In [108]:
df2.reset_index(drop = False)

     A      B         C         D
0  bar    one  1.419167 -0.439225
1  bar  three -0.319439  0.897701
2  bar    two  1.516766 -1.877663
3  foo    one -1.245354 -3.067881
4  foo  three -0.058539  0.708845
5  foo    two -1.179892  0.843882

In [113]:
df2['C']

A    B
bar  one      1.419167
     three   -0.319439
     two      1.516766
foo  one     -1.245354
     three   -0.058539
     two     -1.179892
Name: C, dtype: float64

In [114]:
df2['D']

A    B
bar  one     -0.439225
     three    0.897701
     two     -1.877663
foo  one     -3.067881
     three    0.708845
     two      0.843882
Name: D, dtype: float64

In [115]:
midx = pd.MultiIndex(
    levels=[["zero2", "one"],
            ["x", "y"]], 
    codes=[[1, 1, 0, 0], [1, 0, 1, 0]]
)


df_indeksy = pd.DataFrame(np.random.randn(4, 2), index=midx)
df_indeksy

                0         1
one   y -0.281792  1.173533
      x -0.166128 -0.034385
zero2 y -1.056414 -0.220763
      x  0.111903  0.053648

In [117]:
df_indeksy[0][1]

-0.1661279682562802

In [128]:
df_indeksy.columns = ["A", "B"]

In [130]:
df_indeksy.groupby(['A', 'B']).sum()

Empty DataFrame
Columns: []
Index: [(-1.0564135767060447, -0.22076316715348718), (-0.28179189182370445, 1.1735332433844237), (-0.1661279682562802, -0.03438486105441094), (0.11190285776908089, 0.05364819719565478)]